kendryte/canmv/components/micropython/port/src/standard_lib/network/esp32c3/esp32_control_utils.c
			switch(app_resp->u.wifi_ps.ps_mode) {
				case WIFI_PS_MIN_MODEM:
					printf("Min\n\r");
					break;
				case WIFI_PS_MAX_MODEM:
					printf("Max\n\r");
					break;
				default:
					printf("Invalid\n\r");
					break;
			}
			break;
		} case CTRL_RESP_OTA_BEGIN : {
			printf("OTA begin success\n\r");
			break;
		} case CTRL_RESP_OTA_WRITE : {
			printf("OTA write success\n\r");
			break;
		} case CTRL_RESP_OTA_END : {
			printf("OTA end success\n\r");
			break;
		} case CTRL_RESP_SET_WIFI_MAX_TX_POWER: {
			printf("Set wifi max tx power success\n\r");
			break;
		} case CTRL_RESP_GET_WIFI_CURR_TX_POWER: {
			printf("wifi curr tx power : %d\n\r",
					app_resp->u.wifi_tx_power.power);
			break;
		} case CTRL_RESP_CONFIG_HEARTBEAT: {
			printf("Heartbeat operation successful\n\r");
			break;
		} default: {
			printf("Invalid Response[%u] to parse\n\r", app_resp->msg_id);
			break;
		}
	}

finish_resp:
	CLEANUP_CTRL_MSG(app_resp);
	return SUCCESS;

fail_resp:
	CLEANUP_CTRL_MSG(app_resp);
	return FAILURE;
}

int test_get_wifi_mode(void)
{
	/* implemented Asynchronous */
	ctrl_cmd_t req = CTRL_CMD_DEFAULT_REQ();

	/* register callback for reply */
	req.ctrl_resp_cb = ctrl_app_resp_callback;

	wifi_get_mode(req);

	return SUCCESS;
}


int test_set_wifi_mode(int mode)
{
	/* implemented synchronous */
	ctrl_cmd_t req = CTRL_CMD_DEFAULT_REQ();
	ctrl_cmd_t *resp = NULL;

	req.u.wifi_mode.mode = mode;
	resp = wifi_set_mode(req);

	return ctrl_app_resp_callback(resp);
}

int test_set_wifi_mode_station(void)
{
	return test_set_wifi_mode(WIFI_MODE_STA);
}

int test_set_wifi_mode_softap(void)
{
	return test_set_wifi_mode(WIFI_MODE_AP);
}

int test_set_wifi_mode_station_softap(void)
{
	return test_set_wifi_mode(WIFI_MODE_APSTA);
}

int test_set_wifi_mode_none(void)
{
	return test_set_wifi_mode(WIFI_MODE_NONE);
}

int test_get_wifi_mac_addr(int mode, char *out_mac)
{
	int ret = SUCCESS;
	ctrl_cmd_t *resp = NULL;

	if (!out_mac)
		return FAILURE;

	out_mac[0]='\0';

	/* implemented synchronous */
	ctrl_cmd_t req = CTRL_CMD_DEFAULT_REQ();

	req.u.wifi_mac.mode = mode;
	resp = wifi_get_mac(req);

	ret = ctrl_app_resp_callback(resp);
	if (ret) {
		printf("Failed response for mac\n\r");
		return FAILURE;
	} else {
		if(!resp->u.wifi_mac.mac) {
			printf("NULL MAC returned\n\r");
			return FAILURE;
		}
		strncpy(out_mac, resp->u.wifi_mac.mac, MAX_MAC_STR_LEN);
		out_mac[MAX_MAC_STR_LEN-1] = '\0';
	}
	return SUCCESS;
}

int test_station_mode_get_mac_addr(char *mac)
{
	return test_get_wifi_mac_addr(WIFI_MODE_STA, mac);
}

int test_set_mac_addr(int mode, char *mac)
{
	/* implemented synchronous */
	ctrl_cmd_t req = CTRL_CMD_DEFAULT_REQ();
	ctrl_cmd_t *resp = NULL;

	int ret = test_set_wifi_mode(mode);
	if (ret == SUCCESS) {
		req.u.wifi_mac.mode = mode;
		strncpy(req.u.wifi_mac.mac, mac, MAX_MAC_STR_LEN);
		req.u.wifi_mac.mac[MAX_MAC_STR_LEN-1] = '\0';

		resp = wifi_set_mac(req);
		return ctrl_app_resp_callback(resp);
	}
	return ret;
}


int test_softap_mode_get_mac_addr(char *mac)
{
	return test_get_wifi_mac_addr(WIFI_MODE_AP, mac);
}

int test_async_station_mode_connect(char *ssid, char *pwd, char *bssid,
		int is_wpa3_supported, int listen_interval)
{
	/* implemented Asynchronous */
	ctrl_cmd_t req = CTRL_CMD_DEFAULT_REQ();

	strcpy((char *)&req.u.wifi_ap_config.ssid, ssid);
	strcpy((char *)&req.u.wifi_ap_config.pwd, pwd);
	strcpy((char *)&req.u.wifi_ap_config.bssid, bssid);
	req.u.wifi_ap_config.is_wpa3_supported = is_wpa3_supported;
	req.u.wifi_ap_config.listen_interval = listen_interval;

	/* register callback for handling reply asynch-ly */
	req.ctrl_resp_cb = ctrl_app_resp_callback;

	wifi_connect_ap(req);

	return SUCCESS;
}

int test_station_mode_connect(char *ssid, char *pwd, char *bssid,
		int is_wpa3_supported, int listen_interval)
{
	/* implemented Asynchronous */
	ctrl_cmd_t req = CTRL_CMD_DEFAULT_REQ();
	ctrl_cmd_t *resp = NULL;
	req.cmd_timeout_sec = 10;

	strcpy((char *)&req.u.wifi_ap_config.ssid, ssid);
	strcpy((char *)&req.u.wifi_ap_config.pwd, pwd);
	strcpy((char *)&req.u.wifi_ap_config.bssid, bssid);
	req.u.wifi_ap_config.is_wpa3_supported = is_wpa3_supported;
	req.u.wifi_ap_config.listen_interval = listen_interval;

	resp = wifi_connect_ap(req);

	return ctrl_app_resp_callback(resp);
}

int test_station_mode_get_info(void)
{
	/* implemented synchronous */
	ctrl_cmd_t req = CTRL_CMD_DEFAULT_REQ();
	ctrl_cmd_t *resp = NULL;

	resp = wifi_get_ap_config(req);

	return ctrl_app_resp_callback(resp);
}

int test_get_available_wifi(void)
{
	/* implemented synchronous */
	ctrl_cmd_t req = CTRL_CMD_DEFAULT_REQ();
	req.cmd_timeout_sec = 300;

	ctrl_cmd_t *resp = NULL;

	resp = wifi_ap_scan_list(req);

	return ctrl_app_resp_callback(resp);
}



// int esp32_get_available_wifi(void)
// {
// 	/* implemented synchronous */
// 	ctrl_cmd_t req = CTRL_CMD_DEFAULT_REQ();
// 	req.cmd_timeout_sec = 30;

// 	ctrl_cmd_t *resp = NULL;

// 	resp = wifi_ap_scan_list(req);

// 	//return ctrl_app_resp_callback(resp);

// 	if(resp->msg_id == CTRL_RESP_GET_AP_SCAN_LIST){
// 		wifi_ap_scan_list_t * w_scan_p = &app_resp->u.wifi_ap_scan;
// 		wifi_scanlist_t *list = w_scan_p->out_list;

// 		if (!w_scan_p->count) {
// 			printf("No AP found\n\r");
// 			goto finish_resp;
// 		}
// 		if (!list) {
// 			printf("Failed to get scanned AP list\n\r");
// 			goto fail_resp;
// 		} else {

// 			printf("Number of available APs is %d\n\r", w_scan_p->count);
// 			for (i=0; i<w_scan_p->count; i++) {
// 				printf("%d) ssid \"%s\" bssid \"%s\" rssi \"%d\" channel \"%d\" auth mode \"%d\" \n\r",
// 						i, list[i].ssid, list[i].bssid, list[i].rssi,
// 						list[i].channel, list[i].encryption_mode);
// 			}
// 			esp_msleep(1);
// 		}
// 	}
// }

int test_station_mode_disconnect(void)
{
	/* implemented synchronous */
	ctrl_cmd_t req = CTRL_CMD_DEFAULT_REQ();
	ctrl_cmd_t *resp = NULL;

	resp = wifi_disconnect_ap(req);

	return ctrl_app_resp_callback(resp);
}

int test_softap_mode_start(char *ssid, char *pwd, int channel,
		int encryption_mode, int max_conn, int ssid_hidden, int bw)
{
	/* implemented synchronous */
	ctrl_cmd_t req = CTRL_CMD_DEFAULT_REQ();
	ctrl_cmd_t *resp = NULL;

